/* 주제: 게시판+연락처 - 1단계, 메뉴 출력하기
 * ---------------------------------------
 * [메뉴]
 * 1. 게시판
 * 2. 연락처
 * ---------------------------------------
 * 메뉴 번호를 입력하세요> 1
 * 게시판
 * ---------------------------------------
 * [메뉴]
 * 1. 게시판
 * 2. 연락처
 * ---------------------------------------
 * 메뉴 번호를 입력하세요> 2
 * 연락처
 * ---------------------------------------
 * [메뉴]
 * 1. 게시판
 * 2. 연락처
 * ---------------------------------------
 * 메뉴 번호를 입력하세요> 3
 * 해당 메뉴가 없습니다.
 * ---------------------------------------
 * [메뉴]
 * 1. 게시판
 * 2. 연락처
 * ---------------------------------------
 * 메뉴 번호를 입력하세요>
 */
package step07.ex03;

public class MainApp {

  public static void main(String[] args) {
    System.out.println("Hello, world!");

  }

}
