/* 주제: 상속 - 인스턴스 변수의 상속 
 * 상속(inheritance)이란?
 * => 기존 코드를 중복 작성하지 않고 손쉽게 재사용하기 위한 문법  
 */
package step08.ex01;

public class Exam055 {
  public static void main(String[] args) {
    A p1 = new A();
    A p2 = new A();
    /* 분석
     * 1) 클래스 변수
     *    A => s1  
     * 2) 인스턴스 변수
     *    p1 => i1, i2
     *    p2 => i1, i2
     */
    
    // 기존 A 클래스에 변수를 추가하기
    // => 직접 추가할 수 있다. 
    //    => 기존 코드가 변경되면 이 클래스를 사용한 모든 코드에 영향을 끼친다.
    // => 기존 코드를 그대로 두고 새 코드에 추가한다. 
    //    => 기존 코드를 사용한 프로그램에 영향을 끼치지 않는다.
    //    => 기존 코드를 재사용하는 이점이 있다.
    //    => 문법: 상속
    
    B p3 = new B();
    /* 분석
     * 1) 클래스 변수
     *    B => s2
     * 2) 인스턴스 변수
     *    p3 => i3, i1, i2
     */
    p3.i3 = 100;
    p3.i1 = 200; // A 클래스의 코드를 실행하여 만든 변수
    p3.i2 = 300; // A 클래스의 코드를 실행하여 만든 변수
  }
}









